{
  "feedback": [
    {
      "role": "Sr. IT App Developer",
      "company": "Nationwide Insurance",
      "qualifier": "a Fortune 100",
      "quote": "It was very entertaining and it held my attention from beginning to end."
    },
    {
      "role": "Developer",
      "company": "Nationwide Insurance",
      "qualifier": "a Fortune 100",
      "quote": "Engaging. Entertaining. Brought up good areas of improvement / things to work on."
    },
    {
      "role": "Developer",
      "company": "Nationwide Insurance",
      "qualifier": "a Fortune 100",
      "quote": "Engaged the audience. Drove people to contribute.  Simplified and summarized people's contributions well."
    },
    {
      "role": "App Enhancement Coordinator",
      "company": "Nationwide Insurance",
      "qualifier": "a Fortune 100",
      "quote": "Very good teaching style -- made the content / class enjoyable."
    },
    {
      "role": "Developer",
      "company": "TEKSystems",
      "qualifier": "a medium IT Services Company",
      "quote": "Informative. Insightful. Important."
    },
    {
      "role": "Developer",
      "company": "Tek Systems",
      "qualifier": "a medium IT Services Company",
      "quote": "Great instructor who was intelligent and engaging."
    },
    {
      "role": "Automation Tester",
      "company": "Nationwide Insurance",
      "qualifier": "a Fortune 100",
      "quote": "Very good content & instructor -- engaging and entertaining."
    },
    {
      "role": "App Developer",
      "company": "Nationwide Insurance",
      "qualifier": "a Fortune 100",
      "quote": "The instructor was engaged and fostered a great deal of discussion."
    },
    {
      "role": "App Developer",
      "company": "Nationwide Insurance",
      "qualifier": "a Fortune 100",
      "quote": "The instructor did a fantastic job of keeping the class engaged."
    },
    {
      "role": "Project Manager",
      "company": "Nationwide Insurance",
      "qualifier": "a Fortune 100",
      "quote": "Instructor has given good examples. Worked patiently with class to answer questions."
    },
    {
      "role": "Executive",
      "company": "Nationwide Insurance",
      "qualifier": "a Fortune 100",
      "quote": "Educational, informative, well prepared, entertaining. Good discussion generated and encouraged by instructor"
    },
    {
      "role": "Sr. Developer",
      "company": "Nationwide Insurance",
      "qualifier": "a Fortune 100",
      "quote": "Great class! Instructor was very knowledeable and very thorough when asked questions."
    },
    {
      "role": "Iteration Manager",
      "company": "Nationwide Insurance",
      "qualifier": "a Fortune 100",
      "quote": "Great class! Instructor was very knowledgeable and very thorough when asked questions."
    },
    {
      "role": "App Dev Leader",
      "company": "Nationwide Insurance",
      "qualifier": "a Fortune 100",
      "quote": "Excellent class. Great for beginners or folks with years of experience."
    },
    {
      "role": "App Dev Leader",
      "company": "Nationwide Insurance",
      "qualifier": "a Fortune 100",
      "quote": "Excellent instructor! Great job of \"feeling\" the class and adjusting as necessary."
    },
    {
      "role": "Sr. App Developer",
      "company": "Nationwide Insurance",
      "qualifier": "a Fortune 100",
      "quote": "Great discussions, interesting concepts and the instructor was awesome!"
    },
    {
      "role": "Student",
      "company": "Dev Bootcamp",
      "qualifier": "an immersive bootcamp",
      "quote": "DBC isn't about learning javascript, it is about learning how to learn. In this respect I found Sherif to be very helpful. He had a great intuition about where problems might be which allows the student to struggle through syntax while thinking about concepts."
    },
    {
      "role": "Student",
      "company": "Dev Bootcamp",
      "qualifier": "an immersive bootcamp",
      "quote": "The DBC mentality regarding Assessments is fantastic -- especially Sherif's presentation to our cohort about the idea that we've been trained to hide our ignorance rather than expose our vulnerability."
    },
    {
      "role": "Student",
      "company": "Dev Bootcamp",
      "qualifier": "an immersive bootcamp",
      "quote": "Sherif really helped scale back the session a bit to scaffold the lesson in recursion."
    },
    {
      "role": "Student",
      "company": "Dev Bootcamp",
      "qualifier": "an immersive bootcamp",
      "quote": "Sherif clearly had a direction regarding scope, that appear rehearsed and knew exactly where to go.  Perhaps he's done it some many times he knows when enough is enough."
    },
    {
      "role": "Student",
      "company": "Dev Bootcamp",
      "qualifier": "an immersive bootcamp",
      "quote": "Sherif is awesome! His explanations are clear and concise."
    },
    {
      "role": "Student",
      "company": "Dev Bootcamp",
      "qualifier": "an immersive bootcamp",
      "quote": "I appreciated when Sherif stepped in a few times to cut off rabbit holes when students would ask unnecessarily specific or off topic questions."
    },
    {
      "role": "Student",
      "company": "Dev Bootcamp",
      "qualifier": "an immersive bootcamp",
      "quote": "Sherif's points on meta-learning are AWESOME"
    },
    {
      "role": "Student",
      "company": "Dev Bootcamp",
      "qualifier": "an immersive bootcamp",
      "quote": "This has been an incredible journey. I have learned so much, mostly about how to learn. It's hard to imagine a better teacher than Sherif. He does an incredible job at helping the students feel a sense of ownership of the program, providing a support system for the students, changing our approach for learning, funneling the cohort into a constant state of discomfort that is prime for the mind-melting process I now recognize as learning, making people laugh and smile"
    },
    {
      "role": "Student",
      "company": "Dev Bootcamp",
      "qualifier": "an immersive bootcamp",
      "quote": "Matt [Weitzel] and Sherif were both awesome instructors and made me feel comfortable asking questions. I learned more than I ever thought possible in three weeks.  This gave me a good idea of what to expect from the coding process and made me feel more comfortable being confused."
    },
    {
      "role": "Student",
      "company": "Dev Bootcamp",
      "qualifier": "an immersive bootcamp",
      "quote": "Sherif was great at taking care of us and managing expectations, at the same time did not baby us and gave us enough room to grow on our own with a comfortable amount of discomfort."
    },
    {
      "role": "Student",
      "company": "Dev Bootcamp",
      "qualifier": "an immersive bootcamp",
      "quote": "Can't say enough about the talent and ability of both Sherif and Matt [Weitzel]. Great pair, complemented each other well. Sherif has a wealth of knowledge about programming and is also a natural mentor and educator"
    },
    {
      "role": "Student",
      "company": "Dev Bootcamp",
      "qualifier": "an immersive bootcamp",
      "quote": "I loved Sherif; I truly think he's a guru of teaching and uniquely talented to identify the learning styles and givens of each individual and work within them to optimize learning patterns. His style of speaking is also contagious and very reassuring."
    },
    {
      "role": "Student",
      "company": "Dev Bootcamp",
      "qualifier": "an immersive bootcamp",
      "quote": "Every time I had any feedback or concern I felt as if DBC (particularly my instructors) took them seriously, validated my perspective, and answered/responded honestly and effectively, even when it meant directly disagreeing with me. I could not have appreciated this more."
    },
    {
      "role": "Student",
      "company": "Dev Bootcamp",
      "qualifier": "an immersive bootcamp",
      "quote": "Sherif and Matt [Weitzel] are both very knowledgeable, very emotionally aware, and very willing to help when they're nearby. Working with them one-on-one was extremely helpful."
    },
    {
      "role": "Student",
      "company": "Dev Bootcamp",
      "qualifier": "an immersive bootcamp",
      "quote": "Sherif/Lora pairing session was a big hit."
    },
    {
      "role": "Student",
      "company": "Dev Bootcamp",
      "qualifier": "an immersive bootcamp",
      "quote": "Sherif and Lora [Abe] coding something together was very helpful.  Same thing with Sherif, Lora, and Stephen [Harms]."
    },
    {
      "role": "Student",
      "company": "Dev Bootcamp",
      "qualifier": "an immersive bootcamp",
      "quote": "The first lecture we had with Sherif was laser focused on approach and because of how fast he moves and shares his thought process, we end up getting a lot of \"content\" as well. Everyone loved that lecture."
    },
    {
      "role": "Student",
      "company": "Dev Bootcamp",
      "qualifier": "an immersive bootcamp",
      "quote": "I really liked Sherif's comment: 'you figure it out'."
    },
    {
      "role": "Student",
      "company": "Dev Bootcamp",
      "qualifier": "an immersive bootcamp",
      "quote": "I loved learning about how to learn from Sherif yesterday during his pairing session with Lora [Abe]. I thought it encompassed: teaching new concepts, teaching where to start when you sit down and start with a blank slate, teaching how to search for answers, teaching how to discuss issues. I loved it. It also felt like there was an end teaching goal for the lesson, and that we got there. A logically structured lecture."
    },
    {
      "role": "Student",
      "company": "Dev Bootcamp",
      "qualifier": "an immersive bootcamp",
      "quote": "Two words. More Sherif."
    },
    {
      "role": "Student",
      "company": "Dev Bootcamp",
      "qualifier": "an immersive bootcamp",
      "quote": "Some exercises like those suggested by Sherif (in his over-learning discussion) would be a great inclusion in the pre-course material."
    },
    {
      "role": "Student",
      "company": "Dev Bootcamp",
      "qualifier": "an immersive bootcamp",
      "quote": "Sherif has been awesome at pointing me in the right direction.  I want more of that!"
    },
    {
      "role": "Student",
      "company": "Dev Bootcamp",
      "qualifier": "an immersive bootcamp",
      "quote": "Sherif's presentation on learning mindsets and expertise was pretty inspiring stuff."
    },
    {
      "role": "Student",
      "company": "Dev Bootcamp",
      "qualifier": "an immersive bootcamp",
      "quote": "The conversations/talks from Sherif about learning have been insightful."
    },
    {
      "role": "Student",
      "company": "Dev Bootcamp",
      "qualifier": "an immersive bootcamp",
      "quote": "I really enjoyed all of the talks by Sherif."
    },
    {
      "role": "Student",
      "company": "Dev Bootcamp",
      "qualifier": "an immersive bootcamp",
      "quote": "I appreciated Sherif being involved in a lot of our lectures, because it seemed that he was able to identify gaps in the lecture and make sure that things stayed on track and that people were understanding what was presented."
    },
    {
      "role": "Student",
      "company": "Dev Bootcamp",
      "qualifier": "an immersive bootcamp",
      "quote": "I'm really going to miss Mike [Busch] and Sherif as they leave for Chicago. They're fantastic educators and really talented at conveying abstract concepts into digestible terms for beginners like us :)"
    },
    {
      "role": "Student",
      "company": "Dev Bootcamp",
      "qualifier": "an immersive bootcamp",
      "quote": "Every time that Sherif speaks about learning how to learn (and probably any topic for that matter), it's so inspiring. I want to hear more about this and constantly work on optimizing my learning."
    },
    {
      "role": "Student",
      "company": "Dev Bootcamp",
      "qualifier": "an immersive bootcamp",
      "quote": "Can we please have more talks about learning. I want to hear from people like Jesse [Farmer] and Sherif who are so inspiring to listen to with their understanding of how people learn."
    },
    {
      "role": "Student",
      "company": "Dev Bootcamp",
      "qualifier": "an immersive bootcamp",
      "quote": "I have definitely learned a ton, especially after speaking with Sherif and Jesse [Farmer]."
    },
    {
      "role": "Student",
      "company": "Dev Bootcamp",
      "qualifier": "an immersive bootcamp",
      "quote": "I really enjoyed listening and talking with Sherif and Jesse [Farmer] about the mental approach to coding and how to learn more effectively. Their enthusiasm is something I want to feel more of."
    },
    {
      "role": "Student",
      "company": "Dev Bootcamp",
      "qualifier": "an immersive bootcamp",
      "quote": "I'd like more talks from Sherif. He brings a much different perspective. One that I am fond of."
    },
    {
      "role": "Student",
      "company": "Dev Bootcamp",
      "qualifier": "an immersive bootcamp",
      "quote": "Tanner [Welsh] and Sherif are amazing at setting up a safe environment in which people excel at learning. I don't know how they do it, but there wasn't a single request for help or feedback that was not met with an appropriate and patient response."
    },
    {
      "role": "Student",
      "company": "Dev Bootcamp",
      "qualifier": "an immersive bootcamp",
      "quote": "I love the calm and patient way Sherif explains things and always add some hints on how to approach those kind of problems in a more general way."
    },
    {
      "role": "Student",
      "company": "Dev Bootcamp",
      "qualifier": "an immersive bootcamp",
      "quote": "Sherif really went out of his way to help me through a really tough time, both with coding, but especially emotionally and helping me to figure things out with where I was and where I wanted to go.  Sherif is a truly kind and generous person, as well as being a great teacher."
    },
    {
      "role": "Student",
      "company": "Dev Bootcamp",
      "qualifier": "an immersive bootcamp",
      "quote": "Sherif combines his knowledge with a great understanding of people and learning styles to dissect problems."
    },
    {
      "role": "Student",
      "company": "Dev Bootcamp",
      "qualifier": "an immersive bootcamp",
      "quote": "Sherif's methodical way of testing and thinking, taught me how to dissect my own code as the programs get larger. At first, I got upset because I just wanted to keep banging my head into irb, but Sherif showed me that if you breathe, take a step back and understand where to test and print to debug the problems seem to get easier and smaller."
    },
    {
      "role": "Student",
      "company": "Dev Bootcamp",
      "qualifier": "an immersive bootcamp",
      "quote": "Thanks Sherif. While it is not in my personality to relax and step away you have given me inspiration to do that and it has helped me tremendously."
    },
    {
      "role": "Student",
      "company": "Dev Bootcamp",
      "qualifier": "an immersive bootcamp",
      "quote": "Sherif is very kind. He is sometimes too self-deprecating -- we would be nowhere without him."
    },
    {
      "role": "Student",
      "company": "Dev Bootcamp",
      "qualifier": "an immersive bootcamp",
      "quote": "I like that you like to abstract things and start explaining not with the code at hand but by talking about the bigger picture. I remember the zip method well because of how you explained it to me using the ideas of fingers interlacing much like a zipper."
    },
    {
      "role": "Student",
      "company": "Dev Bootcamp",
      "qualifier": "an immersive bootcamp",
      "quote": "Sherif is a great teacher. I already have so many ideas of what I want to learn outside of DBC based on tips he gave me during the challenges."
    },
    {
      "role": "Student",
      "company": "Dev Bootcamp",
      "qualifier": "an immersive bootcamp",
      "quote": "Sherif is an incredibly smart person and that's been visibly apparent to me whenever I've asked him for help. He knows precisely how to get you to figure out the problem without revealing the answer too much."
    },
    {
      "role": "Student",
      "company": "Dev Bootcamp",
      "qualifier": "an immersive bootcamp",
      "quote": "Sherif is great at spending time with a student and not making them feel self conscious when they don't understand something the first (or second, or third) time."
    },
    {
      "role": "Student",
      "company": "Dev Bootcamp",
      "qualifier": "an immersive bootcamp",
      "quote": "Thank you for being calm, in control, giving actionable advice and feedback, and just caring about me as human as well. Your presence sets me at ease."
    },
    {
      "role": "Student",
      "company": "Dev Bootcamp",
      "qualifier": "an immersive bootcamp",
      "quote": "I found him friendly and supportive, and he also used great metaphors to help me think about problem-solving (especially the \"hamburger in a foreign language\" example)."
    },
    {
      "role": "Student",
      "company": "Dev Bootcamp",
      "qualifier": "an immersive bootcamp",
      "quote": "I asked all the instructors to pair.  Sherif was the only one who did so on a daily basis."
    },
    {
      "role": "Student",
      "company": "Dev Bootcamp",
      "qualifier": "an immersive bootcamp",
      "quote": "Sherif is one of the few teachers I've had who's able to really challenge me and make me think in a different way. His explanations of problems and concepts really helped me."
    },
    {
      "role": "Student",
      "company": "Dev Bootcamp",
      "qualifier": "an immersive bootcamp",
      "quote": "Sherif has the most amazing patience and is so thoroughly and genuinely helpful; if coding was a religion I would suggest he be sainted. I love the way he always looks you in the eye when he speaks to you. It makes you feel like he's fully invested and engaged."
    },
    {
      "role": "Student",
      "company": "Dev Bootcamp",
      "qualifier": "an immersive bootcamp",
      "quote": "You rock... seriously. A giant THANK YOU for all of the time you have put in helping all of us. You truly care about our well-being and you have an amazing way with words when explaining difficult concepts.  We are all lucky to have you around and a lot of us have come a long with in our learning process because of you."
    },
    {
      "role": "Student",
      "company": "Dev Bootcamp",
      "qualifier": "an immersive bootcamp",
      "quote": "Sherif is very approachable.  He is good at breaking down a problem and explaining it in a way that anyone could understand.  He is good at reading a student and understanding what their specific needs are.  He is willing to stay till midnight to help people solve problems.  Great job!"
    },
    {
      "role": "Student",
      "company": "Dev Bootcamp",
      "qualifier": "an immersive bootcamp",
      "quote": "I have not only had technical wrinkles ironed out by you, but I have genuinely started to become more aware of my personal relationships, how I affect others, and how others affect me. I've also become a more effective learner and gained skills that I believe I can use on virtually any topic."
    },
    {
      "role": "Student",
      "company": "Dev Bootcamp",
      "qualifier": "an immersive bootcamp",
      "quote": "Wish everyone was as kind, generous, and helpful as you are! Can't even begin to tell you how much I appreciate the time that you spent with A and P, as well as, of course, the time you spent with me. As a former teacher, I am amazed at your patients [sic] and ability to dumb things down without spoon feeding us anything! Hope that I can abuse and exploit your skills in the next 6 weeks!"
    },
    {
      "role": "Student",
      "company": "Dev Bootcamp",
      "qualifier": "an immersive bootcamp",
      "quote": "I learned a lot from you, especially in our pairing session. You have a great way of eliciting people's thoughts and expectations from them."
    },
    {
      "role": "Student",
      "company": "Dev Bootcamp",
      "qualifier": "an immersive bootcamp",
      "quote": "Sherif is an amazing, inspiring person.  He is an excellent teacher and mentor."
    }
  ]
}